Pizzaria/models/Utilizador.php

SELECT * FROM `utilizador` WHERE `id`=6
---
    public static function findIdentity($id){
        return static::findOne($id);

SELECT * FROM `utilizador` WHERE `username`='xicoest'
---
    public static function findByUsername($username){
        return self::findOne(['username'=>$username]);